// 抛出修改主体的核心包装接口结构对象
module.exports = {
  // 面向后台代码及运维管理的描述解释配置
  /**
   * 修改区域
   * @url admin/base-area/sys/update
   */
  // main 函数承接客户端调用修改发生的核心触发动作主控权
  main: async (event) => {
    // 在此事件入参中解析前端表单修改项 data 与服务器提供环境基础类 util
    let { data = {}, util } = event;
    // 解构获取直接操控 vk-fun 底层与底层数据库环境的强力执行器封装
    let { vk } = util;
    // 第一动作先构建一个不含报警错误的通用来电返空信封
    let res = { code: 0, msg: '' };
    
    // -----------------------------------------------------------
    // 业务逻辑开始
    // -----------------------------------------------------------
    
    // 从数据流中捞出所要变更具体文档的标识钥匙值 _id
    let _id = data._id;
    // 如果没有被明确告知到底修改哪一行直接当做恶意访问并回发警告
    if (!_id) return { code: -1, msg: "缺少修改标靶数据 _id" };

    // 当用户欲调整该区域生命体征状态至冻结、禁用形态 (0) 时进行高敏感强验证
    if (data.status === 0) {
      // 通过 vk 下钻向数据库询问当前要禁用的组织块体内是否还寄宿了存活点
      let pointCount = await vk.baseDao.count({
        // 查询方向瞄准业务前线的活动收集基站群库
        dbName: "base-point",
        // 查找这些点里属不属于欲变更当前禁用状态的此 _id 旗下
        whereJson: { area_id: _id }
      });
      // 一旦判定该块底下拥有依然有效尚未清理的基层驻守据点数据行
      if (pointCount > 0) {
        // 立刻下传系统级禁行令并说明理由使其必须通过安全清理渠道
        return { code: -1, msg: "存在安全冲突：下级还有作业检查点处于关联状态，若将其冻结恐致盲数据网络链，须先迁除所有点位" };
      }
    }

    // 全部风险阻断查明均无碍后即可进入物理落地的覆盖更改命令调用
    res.num = await vk.baseDao.updateById({
      // 指认出即将落刀操作的数据表名叫 base-area
      dbName: "base-area",
      // 把上方筛验过合法的_id赋予目标确认项
      id: _id,
      // 传递从客户端采集携带修改意见的整份表格结果体给底层解析去合并写库
      dataJson: data
    });
    // 收卷将响应带有多少条遭更新数字（即1条）发给页面，更新前端表单显性逻辑完成
    return res;
  }
};
